hoshinoht/forest-link-protocol/flp-node/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=0
CONFIG_FREERTOS_HZ=1000
CONFIG_SPI_FLASH_ROM_IMPL=y
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_FLP_OLED_ENABLED=y
CONFIG_FLP_OLED_SDA=18
CONFIG_FLP_OLED_SCL=17
CONFIG_FLP_OLED_RST=-1

# IMPORTANT NOTE: As this is a prototype we will be hardcoding the Wi-Fi credentials for simplicity.
# In a production system, you would want to implement a more secure and flexible way of configuring
# Wi-Fi credentials (e.g., via a web interface, Bluetooth, or a mobile app

# Please change the following Wi-Fi credentials to your own Wi-Fi network before
# building and flashing the firmware.
CONFIG_FLP_WIFI_SSID="hoshiyomi"
CONFIG_FLP_WIFI_PASSWORD="Kiseki033171"


# Mqtt gateway
FLP_MQTT_BROKER_URI="mqtt://192.168.0.6"
